{
  "architectures": [
    "ConvNextForImageClassification"
  ],
  "depths": [
    3,
    3,
    27,
    3
  ],
  "drop_path_rate": 0.0,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_sizes": [
    128,
    256,
    512,
    1024
  ],
  "id2label": {
    "0": "707-320",
    "1": "727-200",
    "2": "737-200",
    "3": "737-300",
    "4": "737-400",
    "5": "737-500",
    "6": "737-600",
    "7": "737-700",
    "8": "737-800",
    "9": "737-900",
    "10": "747-100",
    "11": "747-200",
    "12": "747-300",
    "13": "747-400",
    "14": "757-200",
    "15": "757-300",
    "16": "767-200",
    "17": "767-300",
    "18": "767-400",
    "19": "777-200",
    "20": "777-300",
    "21": "A300B4",
    "22": "A310",
    "23": "A318",
    "24": "A319",
    "25": "A320",
    "26": "A321",
    "27": "A330-200",
    "28": "A330-300",
    "29": "A340-200",
    "30": "A340-300",
    "31": "A340-500",
    "32": "A340-600",
    "33": "A380",
    "34": "ATR-42",
    "35": "ATR-72",
    "36": "An-12",
    "37": "BAE 146-200",
    "38": "BAE 146-300",
    "39": "BAE-125",
    "40": "Beechcraft 1900",
    "41": "Boeing 717",
    "42": "C-130",
    "43": "C-47",
    "44": "CRJ-200",
    "45": "CRJ-700",
    "46": "CRJ-900",
    "47": "Cessna 172",
    "48": "Cessna 208",
    "49": "Cessna 525",
    "50": "Cessna 560",
    "51": "Challenger 600",
    "52": "DC-10",
    "53": "DC-3",
    "54": "DC-6",
    "55": "DC-8",
    "56": "DC-9-30",
    "57": "DH-82",
    "58": "DHC-1",
    "59": "DHC-6",
    "60": "DHC-8-100",
    "61": "DHC-8-300",
    "62": "DR-400",
    "63": "Dornier 328",
    "64": "E-170",
    "65": "E-190",
    "66": "E-195",
    "67": "EMB-120",
    "68": "ERJ 135",
    "69": "ERJ 145",
    "70": "Embraer Legacy 600",
    "71": "Eurofighter Typhoon",
    "72": "F-16A/B",
    "73": "F/A-18",
    "74": "Falcon 2000",
    "75": "Falcon 900",
    "76": "Fokker 100",
    "77": "Fokker 50",
    "78": "Fokker 70",
    "79": "Global Express",
    "80": "Gulfstream IV",
    "81": "Gulfstream V",
    "82": "Hawk T1",
    "83": "Il-76",
    "84": "L-1011",
    "85": "MD-11",
    "86": "MD-80",
    "87": "MD-87",
    "88": "MD-90",
    "89": "Metroliner",
    "90": "Model B200",
    "91": "PA-28",
    "92": "SR-20",
    "93": "Saab 2000",
    "94": "Saab 340",
    "95": "Spitfire",
    "96": "Tornado",
    "97": "Tu-134",
    "98": "Tu-154",
    "99": "Yak-42"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "707-320": 0,
    "727-200": 1,
    "737-200": 2,
    "737-300": 3,
    "737-400": 4,
    "737-500": 5,
    "737-600": 6,
    "737-700": 7,
    "737-800": 8,
    "737-900": 9,
    "747-100": 10,
    "747-200": 11,
    "747-300": 12,
    "747-400": 13,
    "757-200": 14,
    "757-300": 15,
    "767-200": 16,
    "767-300": 17,
    "767-400": 18,
    "777-200": 19,
    "777-300": 20,
    "A300B4": 21,
    "A310": 22,
    "A318": 23,
    "A319": 24,
    "A320": 25,
    "A321": 26,
    "A330-200": 27,
    "A330-300": 28,
    "A340-200": 29,
    "A340-300": 30,
    "A340-500": 31,
    "A340-600": 32,
    "A380": 33,
    "ATR-42": 34,
    "ATR-72": 35,
    "An-12": 36,
    "BAE 146-200": 37,
    "BAE 146-300": 38,
    "BAE-125": 39,
    "Beechcraft 1900": 40,
    "Boeing 717": 41,
    "C-130": 42,
    "C-47": 43,
    "CRJ-200": 44,
    "CRJ-700": 45,
    "CRJ-900": 46,
    "Cessna 172": 47,
    "Cessna 208": 48,
    "Cessna 525": 49,
    "Cessna 560": 50,
    "Challenger 600": 51,
    "DC-10": 52,
    "DC-3": 53,
    "DC-6": 54,
    "DC-8": 55,
    "DC-9-30": 56,
    "DH-82": 57,
    "DHC-1": 58,
    "DHC-6": 59,
    "DHC-8-100": 60,
    "DHC-8-300": 61,
    "DR-400": 62,
    "Dornier 328": 63,
    "E-170": 64,
    "E-190": 65,
    "E-195": 66,
    "EMB-120": 67,
    "ERJ 135": 68,
    "ERJ 145": 69,
    "Embraer Legacy 600": 70,
    "Eurofighter Typhoon": 71,
    "F-16A/B": 72,
    "F/A-18": 73,
    "Falcon 2000": 74,
    "Falcon 900": 75,
    "Fokker 100": 76,
    "Fokker 50": 77,
    "Fokker 70": 78,
    "Global Express": 79,
    "Gulfstream IV": 80,
    "Gulfstream V": 81,
    "Hawk T1": 82,
    "Il-76": 83,
    "L-1011": 84,
    "MD-11": 85,
    "MD-80": 86,
    "MD-87": 87,
    "MD-90": 88,
    "Metroliner": 89,
    "Model B200": 90,
    "PA-28": 91,
    "SR-20": 92,
    "Saab 2000": 93,
    "Saab 340": 94,
    "Spitfire": 95,
    "Tornado": 96,
    "Tu-134": 97,
    "Tu-154": 98,
    "Yak-42": 99
  },
  "layer_norm_eps": 1e-12,
  "layer_scale_init_value": 1e-06,
  "model_type": "convnext",
  "num_channels": 3,
  "num_stages": 4,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "transformers_version": "4.57.6"
}
